case_turb/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            zeroGradient;
//        type            pressureInletOutletVelocity;
//        value           $internalField;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    wall
    {
//        type            movingWallVelocity;
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    defaultFaces
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    "procB.*"
    {
        type            processor;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
