case_turb/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

PIMPLE
{
    nOuterCorrectors 2;
    nNonOrthogonalCorrectors 2;
    nCorrectors         3;
    consistent yes;
    outerCorrectorResidualControl
    {
        U
        {
            tolerance   0.0001;
            relTol      0;
        }
        p
        {
            tolerance   0.0001;
            relTol      0;
        }
    }
    pRefValue   0;
    pRefCell    0;
}

SIMPLE
{
    // Adds iterations for non-orthogonality error corrections
    nNonOrthogonalCorrectors 3;

    // consistent uses SIMPLEC algorithm, generally more robust
    consistent yes;
    residualControl
    {
        p 1e-4;
        U 1e-4;
        "(k|epsilon|omega|f|v2|nuTilda)" 0.0001;
    }
    pRefValue   0;
    pRefCell    0;
}


potentialFlow
{
    nNonOrthogonalCorrectors 8;

    PhiRefValue 0;
    PhiRefCell 0;
}

solvers
{
    "(p|p_rgh|pcorr)"
    {
        solver           GAMG;
        tolerance        1e-9;
        relTol           0.001;
        smoother         symGaussSeidel;
/*        nPreSweeps       0;*/
/*        nPostSweeps      2;*/
/*        cacheAgglomeration on;*/
/*        agglomerator     faceAreaPair;*/
/*        nCellsInCoarsestLevel 10;*/
/*        mergeLevels      1;*/
    }

    "(pFinal|p_rghFinal|pcorrFinal)"
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon|omega|R|nuTilda).*"
    {
        solver           smoothSolver;
        smoother         symGaussSeidel;
        tolerance        1e-7;
        relTol           0.01;
/*        nSweeps          1;*/
    }

    UFinal
    {
        $U;
        relTol           0;
    }

    Phi
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }
}

relaxationFactors
{

    fields
    {
        p           0.3;
      	pFinal	    0.3;
    }
    equations
    {
        U           0.7;
      	UFinal	    0.7;
    }

}

/*cache*/
/*{*/
/*    grad(U);*/
/*}*/

// ************************************************************************* //
